
VISIBILITY_LEVELS = (
    ('personal', 'Персональный'),
    ('school', 'Школьный'),
    ('global', 'Глобальный'),
)

SUBJECTS = (
    ('maths', 'Математика'),
    ('literature', 'Литература'),
    ('physics', 'Физика'),
    ('biology', 'Биология'),
    ('russian', 'Русский язык'),
)

STEPS = (
    ('1', '1-я параллель'),
    ('2', '2-я параллель'),
    ('3', '3-я параллель'),
    ('4', '4-я параллель'),
    ('5', '5-я параллель'),
    ('6', '6-я параллель'),
    ('7', '7-я параллель'),
    ('8', '8-я параллель'),
    ('9', '9-я параллель'),
    ('10', '10-я параллель'),
    ('11', '11-я параллель'),
    ('12', '12-я параллель'),
)
