
VISIBILITY_LEVELS = (
    ('personal', 'Персональный'),
    ('school', 'Школьный'),
    ('global', 'Глобальный'),
)

SUBJECTS = (
    ('maths', 'Математика'),
    ('literature', 'Литература'),
    ('physics', 'Физика'),
    ('biology', 'Биология'),
    ('russian', 'Русский язык'),
)

STEPS = (
    ('1', '1-я параллель'),
    ('2', '2-я параллель'),
    ('3', '3-я параллель'),
    ('4', '4-я параллель'),
    ('5', '5-я параллель'),
    ('6', '6-я параллель'),
    ('7', '7-я параллель'),
    ('8', '8-я параллель'),
    ('9', '9-я параллель'),
    ('10', '10-я параллель'),
    ('11', '11-я параллель'),
    ('12', '12-я параллель'),
)

TAG_OWNERS = (
    ('module', 'Модуль'),
    ('task', 'Задание'),
)

TASK_TYPES = (
    ('motivating', 'Мотивирующее'),
    ('educational', 'Учебное'),
    ('verification', 'Проверочное'),
)

CHECK_TYPES = (
    ('teacher', 'Проверка учителем'),
    ('auto', 'Автоматическая'),
    ('self', 'Самопроверка'),
    ('mutually', 'Взаимопроверка'),
)

WORK_TYPES = (
    ('individual', 'Индивидуально'),
    ('group', 'В малых группах'),
    ('pair', 'В парах'),
    ('class', 'В классе'),
)

WAYS = (
    ('nothing', 'Не указано'),
    ('offline', 'Офлайн'),
    ('online', 'Онлайн'),
)

SOFT_SKILLS = (
    ('make_decisions', 'Принятие решений'),
    ('team_work', 'Работа в команде'),
    ('self_management', 'Управление собой'),
    ('creative', 'Креативное мышление'),
    ('critical', 'Критическое мышление'),
    ('emotion', 'Эмоциональный интеллект'),
    ('system', 'Системное мышление'),
)

LICENCE_TYPES = (
    ('CC0', 'CC0'),
    ('BY', 'BY'),
    ('BY-SA', 'BY-SA'),
    ('BY-NC', 'BY-NC'),
    ('BY-NC-SA', 'BY-NC-SA'),
    ('BY-ND', 'BY-ND'),
    ('BY-NC-ND', 'BY-NC-ND'),
)

STATUSES = (
    ('draft', 'Черновик'),
    ('check', 'Проверка'),
    ('add_work', 'Доработка'),
    ('ready', 'Целевая группа'),
    ('public', 'Публичный'),
    ('archive', 'Архив'),
)

LEVEL_STEPS = (
    ('2', '2.0'),
    ('3', '3.0'),
    ('4', '4.0'),
)
